Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelCreationTypeEnum
Defines the model creation type.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelCreationTypeEnum.FULL_MODEL
Creates an analysis model using the full model.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelCreationTypeEnum.BY_WORK_AREA
Creates an analysis model using the selected area.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelCreationTypeEnum.BY_SELECTED_PARTS
Creates an analysis model using the selected parts.

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelCreationTypeEnum.BY_SELECTED_PARTS_AND_LOADS
Creates an analysis model using the selected parts and loads.
a

Tekla.Structures.Analysis.AnalysisModelGeneralProperties.ModelCreationTypeEnum.FLOOR_MODEL_BY_SELECTED_PARTS_AND_LOADS
Creates a floor model using the selected parts and loads.